1s/ERP/Conf/Catalogs/Лико_Конверты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_Конверты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОрганизацияГруппы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ящик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Секция</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКонверта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлощадкаГруппы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_Конверты/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
 
 #Область ПрограммныйИнтерфейс
 
 // Функция получает 15-значный штрихкод Объекта номенклатуры
// управл.символ	вид информации		код конверта     нарезка     количество     серийный номер     контр.символ
//      6                01                 1234567            123         1234          123456789012           N
Функция ПолучитьШтрихКод(ЭтотОбъект,ШКСтрокой="") Экспорт
	
	Перем ШК;
	
	ВидИнформации = 4;
	
	//=--------- ШК с пробелами и без -----
	// так было
	//ШК = "6"+ Формат(ВидИнформации, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=0")
	//		+ Формат(КодНоменклатуры7, "ЧЦ=7; ЧН=0000000; ЧВН=; ЧГ=0")   // 7 правых символов кода номенклатуры
	//		+ Формат(ЭтотОбъект.Нарезка.Размер, "ЧЦ=3; ЧН=000; ЧВН=; ЧГ=0") // 3 символа нарезки
	//		+ Формат(ЭтотОбъект.Количество, "ЧЦ=4; ЧН=0000; ЧВН=; ЧГ=0") // 4 символа количества в поставке (вес банки, количество пог.метров)
	//		
	//		//+ Формат(ЭтотОбъект.НомерПоставки, "ЧЦ=12; ЧН=000000000000; ЧВН=; ЧГ=0"); // 12 символов серийного номера
	//		+ Формат(ЭтотОбъект.Код, "ЧЦ=7; ЧН=0000000; ЧВН=; ЧГ=0") // 7 символов код объекта номенклатуры
	//		+ Формат(ЭтотОбъект.НомерПоставки, "ЧЦ=5; ЧН=00000; ЧВН=; ЧГ=0"); // 5 символов серийного номера
	//		//+ Формат(ЭтотОбъект.Код,"ЧЦ="+ЭтотОбъект.Метаданные().ДлинаКода+"; ЧВН=; ЧГ=0");
	// так есть
	
	ФВидИнформации = Формат(ВидИнформации, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=0");
	ФКод = ЭтотОбъект.Код;
	
	Разделитель = " ";
	
	ШК = "6"+ ФВидИнформации
			+ ФКод;
	
	ШКСтрокой = "6"+ ФВидИнформации + Разделитель
			+ ФКод + Разделитель;
			
	КонтольныйСимвол = Лико_Дополнительно.ПосчитатьКонтрольнуюСуммуШК(ШК);
	ШК = ШК + КонтольныйСимвол;
	ШКСтрокой = ШКСтрокой + КонтольныйСимвол;
	
	Возврат ШК;
КонецФункции //ПолучитьШтрихКод Экспорт
 
Функция ПечатьКонверта(Конверт) Экспорт 
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Конверт);
	
	Возврат ПечатьЗадания(МассивОбъектов, Неопределено);

КонецФункции // ПечатьКонверта()

Процедура СоздатьРаспечататьКонверт(ГруппаКонвертов, Тип, Индекс,ТабличныйДокумент, Конверт) Экспорт
	
	Префикс = ГруппаКонвертов.ПрефиксГруппы;
	
	ПолныйКод = "" + СокрЛП(Префикс) + Формат(Индекс, "ЧЦ=7; ЧН=0000000; ЧВН=; ЧГ=0") + "/" + Формат(Тип, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=0");
	
	Конверт = Справочники.Лико_Конверты.НайтиПоКоду(ПолныйКод);
	
	Если Не ЗначениеЗаполнено(Конверт) Тогда
		НовыйКонверт = Справочники.Лико_Конверты.СоздатьЭлемент();
		НовыйКонверт.Код = ПолныйКод;
		НовыйКонверт.Наименование = ПолучитьБезПрефикса(ПолныйКод);
		НовыйКонверт.ТипКонверта = Тип;
		НовыйКонверт.Родитель = ГруппаКонвертов;
		НовыйКонверт.Организация = ГруппаКонвертов.Организация;
		НовыйКонверт.Площадка = ГруппаКонвертов.Площадка;
		НовыйКонверт.Записать();
		
		КонвертОбъект = НовыйКонверт;
		Конверт = НовыйКонверт.Ссылка;
		
	Иначе
		
		КонвертОбъект = Конверт.ПолучитьОбъект();
		
	КонецЕсли;
	
	КоличествоКопий = 1;
	ТабличныйДокумент = ПечатьКонверта(Конверт);
	
	
	
КонецПроцедуры //СоздатьРаспечататьКонверт

Функция ПолучитьБезПрефикса(Знач КодНомер, УдалятьВедущиеНули=Истина) Экспорт
	
	КодНомер = СокрЛП(КодНомер);
	
	// удаление ведущих букв
	Завершили = Ложь;
	Пока Не Завершили Цикл
		
		Если СтрДлина(КодНомер)=0 Тогда
			Завершили = Истина;
		КонецЕсли;
		
		Символ1 = Лев(КодНомер, 1);
		Если Символ1="0" Или Символ1="1" Или Символ1="2" Или Символ1="3" Или Символ1="4"
			Или Символ1="5"Или Символ1="6" Или Символ1="7" Или Символ1="8" Или Символ1="9" Тогда
			Завершили = Истина;
		КонецЕсли;
		
		Если Не Завершили Тогда
			КодНомер = Сред(КодНомер, 2);
		КонецЕсли;
		
	КонецЦикла;
	
	// удаление ведущих нулей
	Если УдалятьВедущиеНули Тогда
		
		Пока Лев(КодНомер, 1)="0" Цикл
			КодНомер = Сред(КодНомер, 2);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат КодНомер;

КонецФункции // ПолучитьБезПрефиксов()

Функция МаксимальныйНомерКонверта(ТипКонверта, ГруппаКонвертов) Экспорт 
	Результат=0;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(Лико_Конверты.Код) КАК Код
	|ПОМЕСТИТЬ ВтИтог
	|ИЗ
	|	Справочник.Лико_Конверты КАК Лико_Конверты
	|ГДЕ
	|	Лико_Конверты.ТипКонверта = &ТипКонверта
	|	И Лико_Конверты.Родитель = &Родитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтИтог.Код КАК Код
	|ИЗ
	|	ВтИтог КАК ВтИтог
	|ГДЕ
	|	НЕ ВтИтог.Код ЕСТЬ NULL";
	Запрос.УстановитьПараметр("ТипКонверта",ТипКонверта ); 
	Запрос.УстановитьПараметр("Родитель",ГруппаКонвертов );

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Результат = ЧислоПоКоду(Выборка.Код);
	
	КонецЦикла; 
	
	//Если ЗначениеЗаполнено(Результат) Тогда
	//	Результат =  ЧислоПоКоду(Результат);
	//КонецЕсли;
	//
	
   Возврат Результат;


КонецФункции 

Функция НомерКонверта(Конверт) Экспорт 
	
	Возврат ЧислоПоКоду(Конверт.Код); 
	
	
	
КонецФункции  


#КонецОбласти
  
 #Область СлужебныеПроцедурыИФункции
 
 #Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПечатьКонверта";
	КомандаПечати.Представление = НСтр("ru = 'Печать конверта'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;	
	КомандаПечати.СразуНаПринтер = Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ПечатьСразуНаПринтер",Ложь);	
	
	
	
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатьКонверта") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ПечатьКонверта",
		НСтр("ru = 'Печать конверта'"),
		ПечатьЗадания(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
КонецПроцедуры

Функция ПечатьЗадания(МассивОбъектов, ОбъектыПечати)
	
	
	
	КолонкаКодов = ФормированиеПечатныхФорм.ДополнительнаяКолонкаПечатныхФормДокументов().ИмяКолонки;
	
	ВыводитьКоды = ЗначениеЗаполнено(КолонкаКодов);

	
	
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "Лико_ПАРАМЕТРЫ_ПЕЧАТИ_Конверт";
	
		
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.Лико_Конверты.ПФ_MXL_СтикерКонверта");
	
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	
	
	ПервыйДокумент = Истина;	
	Для Каждого Объект Из МассивОбъектов Цикл 		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли; 		
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ШКСТрокой = "";
	
	
	ШК = ПолучитьШтрихКод(Объект,ШКСтрокой); //длина штрихкода - 13 (Расшифровка символов в ОбработкаШК)
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("Наименование", Объект.Наименование);
	
	
	// Выводим шапку
	
	ОбластьШапка.Параметры.ШтрихКодСтрокой = ШКСТрокой;
	
	
		Эталон = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("Эталон");
	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
	
	ПараметрыШтрихкода = Новый Структура;
	ПараметрыШтрихкода.Вставить("Ширина",          Окр(ОбластьШапка.Рисунки.КартинкаШтрихкода.Ширина / КоличествоМиллиметровВПикселе));
	ПараметрыШтрихкода.Вставить("Высота",          Окр(ОбластьШапка.Рисунки.КартинкаШтрихкода.Высота / КоличествоМиллиметровВПикселе));
	ПараметрыШтрихкода.Вставить("Штрихкод",        СокрЛП(ШК));
	ПараметрыШтрихкода.Вставить("ТипКода",         4); // Code128
	ПараметрыШтрихкода.Вставить("ОтображатьТекст", Ложь);
	ПараметрыШтрихкода.Вставить("РазмерШрифта",    6);
	
	ОбластьШапка.Рисунки.КартинкаШтрихкода.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
	

	
	
	
	ОбластьШапка.Параметры.Заполнить(ПараметрыПечати);
	ТабличныйДокумент.Вывести(ОбластьШапка);
	КонецЦикла;   	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ПолеСлева 	= 1;
	ТабличныйДокумент.ПолеСправа	= 0;
	ТабличныйДокумент.ПолеСнизу 	= 0;
	ТабличныйДокумент.ПолеСверху 	= 1;
	
	ИмяПринтера = СокрЛП(Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ИмяПринтераЭтикеток", ""));
	ТабличныйДокумент.ИмяПринтера = ИмяПринтера; 	
	ТабличныйДокумент.АвтоМасштаб = Истина; 	
	Возврат ТабличныйДокумент;	
КонецФункции

 
#КонецОбласти

 
 Функция ЧислоПоКоду (Код) 
	
	КодБезПрефикса = ПолучитьБезПрефикса(Код,Истина);
	ДлинаКода = СтрНайти(КодБезПрефикса,"/")-1;
	
	Возврат Число(Лев(КодБезПрефикса,ДлинаКода));
	
КонецФункции 

 
 #КонецОбласти

 #КонецЕсли
